f# -*- mode:org -*-
#+startup:fold
  *bpip1b0* : positive pion beam, produce stopped pion output file, default configuration 
  with 0.7T magnetic field
  pi+ lifetime is ON, use for validating the weighted simulation
# ----------------------------------------------------------------------------------------------------
 - directory       : file:./
 - configuration   : [[file:./init_project.py][init_project.py]]
 - submitted jobs  : file:../AAA_SUBMITTED_JOBS
 - grid input      : file:/pnfs/mu2e/resilient/users/murat/
 - grid output     : file:/pnfs/mu2e/scratch/users/murat/workflow
 - output_location : file:/mu2e/data2/users/murat/
 - catalogs        : file:./catalog
 - fcl             : file:../../tmp/pipenu/fcl
# ----------------------------------------------------------------------------------------------------

|--------+-----------------+---------+------------+--------+--------+-------+-----------------+--------+---------+--------+---------+-----------|
| job    | input dsid      | Nevents | Resampling | Nfiles | Nfiles | Njobs | output_dsid     | Nfiles | Nevents |    Nev | upload  | comments  |
|        |                 |         |     factor |        | / job  |       |                 |        |         |  /file |         |           |
|--------+-----------------+---------+------------+--------+--------+-------+-----------------+--------+---------+--------+---------+-----------|
| [[file:s1_sim_bmup0b0.fcl][s1_sim]] | bpip0b0s00r0000 |     1e9 |          1 |        | 1      |       | bmup0b0s11r0000 |        |         |   7400 |         |           |
| [[file:s2_sim_bmup0b0.fcl][s2_sim]] | bmup0b0s11r0000 |         |          1 |        |        |       |                 |        |         | 147500 | on tape |           |
|        |                 |         |            |        |        |       | bmup0b0s21r0000 |        |         |        |         | STT stops |
** stage 1 (up to DS)                                                                                         

|    nevents | mode  | BField           | N(mu) | N(muon stops) | N(oot) |    CPU |    real | comment                   |
|------------+-------+------------------+-------+---------------+--------+--------+---------+---------------------------|
|      10000 | debug |                  |       |               |        | 939.23 | 730.937 |                           |
|      10000 | prof  |                  |       |               |        | 383.67 | 224.188 |                           |
|      20000 | prof  | bfgeom_v01       |    74 |            28 |        | 701.42 | 383.228 |                           |
|      20000 | prof  | bfgeom_no_ds_v01 |    73 |            25 |        | 701.42 | 383.228 |                           |
|     200000 | prof  | bfgeom_no_ds_v01 |   883 |           317 |    539 |        |         |                           |
|     200000 | prof  | bfgeom_v01       |   887 |           332 |    532 |        |         |                           |
|------------+-------+------------------+-------+---------------+--------+--------+---------+---------------------------|
| w/o offset |       |                  |       |               |        | 317.75 |         |                           |
|  per event |       |                  |       |               |        | 3.2e-2 |         | count on 100K events/hour |
|            |       |                  |       |               |        |        |         |                           |
#+TBLFM: @4$7=@3$7-@2$7

MemReport  ---------- Memory summary [base-10 MB] ------
MemReport  VmPeak = 2690.95 VmHWM = 1964.63
